Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: It is generally best to insert these "break points" at positions where the active window does not matter to the script, such as immediately before a WinActivate function.
ja: 一般的に、これらの「ブレークポイント」は、WinActivate関数の直前など、スクリプトにとってアクティブウィンドウが重要でない位置に挿入するのがベストである。

source: It is important to note that __New may be called once for the class in which it is defined and once for each subclass which does not define its own (or which calls super.__New()).
ja: __Newは、それが定義されているクラスに対して一度だけ呼び出されることに注意することが重要でありそして、定義されていないサブクラス（またはsuper.__New()を呼び出すサブクラス）ではそれぞれ1回呼び出されるということです。

source: It is important to note that a variable and its value are not the same thing.
ja: 注意すべきは、変数とその値は同じではないことです。

source: It is important to take into account methods which are inherited from parent interfaces.
ja: 親インターフェースから継承されるメソッドを考慮することが重要です。

source: It is important to understand that sending a key does not perfectly replicate the act of physically pressing the key, even if you slow it down to human speeds.
ja: キーを送信することで、人間の速度まで遅くしても、物理的にキーを押す行為が完全に再現されるわけではないことを理解しておく必要があります。

source: It is just a normal property name, not reserved.
ja: 予約ではなく、通常のプロパティ名です。

source: It is most commonly used to find PNG, GIF, and TIF files that have some transparent areas (however, icons do not need this option because their transparency is automatically supported).
ja: 透明な部分があるPNG、GIF、TIFファイルを探すのに最もよく使われます（ただし、アイコンは自動的に透明化されるため、このオプションは必要ありません）。

source: It is necessary to press Ctrl first in this example.
ja: この例では、最初にCtrlを押すことが必要です。

source: It is no longer applied by default to Radio controls.
ja: ラジオコントロールにはデフォルトで適用されなくなりました。

source: It is no longer optional, except with functions which can operate on a top-level window (ControlSend[Text], ControlClick, SendMessage, PostMessage) or when preceded by other optional parameters (ListViewGetContent, ControlGetPos, ControlMove).
ja: ただし、トップレベルウィンドウを操作できる関数（ControlSend[Text]、ControlClick、SendMessage、PostMessage）、または他のオプションパラメータが先行する場合（ListViewGetContent、ControlGetPos、ControlMove）は除きます。

source: It is normally not necessary to destroy ImageLists because once attached to a ListView, they are destroyed automatically when the ListView or its parent window is destroyed.
ja: ImageListはListViewに装着されると、ListViewまたはその親ウィンドウが破壊されたときに自動的に破壊されるため、通常は破壊する必要はない。

source: It is not necessary to apply AltSubmit to enable additional events.
ja: AltSubmitを適用して追加イベントを有効にする必要はありません。

source: It is not necessary to do SetTitleMatchMode "Slow" because ControlGetText always retrieves the text using the slow method (since it works on a broader range of control types).
ja: ControlGetTextは常にスローメソッドでテキストを取得するため、SetTitleMatchMode "Slow"を行う必要はありません（より広範囲のコントロールタイプで動作するため）。

source: It is not necessary to do SetTitleMatchMode "Slow" because ControlGetText always retrieves the text using the slow mode (since it works on a broader range of control types).
ja: ControlGetText関数は様々なタイプのコントロールに対して動作させるため、常に低速モードを使用してテキストを取得します。そのため、SetTitleMatchMode "Slow"を実行する必要はありません。

source: It is not necessary to do SetTitleMatchMode "Slow" because WinGetText always retrieves the text using the slow mode (since it works on a broader range of control types).
ja: WinGetText関数は様々なタイプのコントロールに対して動作させるため、常に低速モードを使用してテキストを取得します。そのため、SetTitleMatchMode "Slow"を実行する必要はありません。

source: It is not possible for local labels to be called externally (even by built-in functions).
ja: ローカルラベルを外部から（組み込み関数でも）呼び出すことはできません。

source: It is not possible to construct a VarRef for a property of an object (such as foo.bar), A_Clipboard or any other built-in variable, so those cannot be passed ByRef.
ja: オブジェクトのプロパティ（foo.barなど）やA_Clipboardなどの 組み込み変数に対してVarRefを構成することはできないので、これらをByRefで渡すことはできない。

source: It is not possible to have optional parameters isolated in the middle of the parameter list.
ja: オプションのパラメータをパラメータリストの途中で孤立させることはできません。

source: It is not possible to pass an object property or built-in variable by reference, and therefore not valid to pass one to this function.
ja: オブジェクトのプロパティや 組み込み変数を参照渡しすることはできないので、この関数に渡しても無効である。

source: It is not the purpose of this section to induce you to infringe any patents or other property right claims or to contest validity of any such claims; this section has the sole purpose of protecting the integrity of the free software distribution system, which is implemented by public license practices.
ja: このセクションの目的は、特許やその他の財産権の主張を侵害するようにあなたを誘導したり、そのような主張の有効性を争ったりすることではありません。このセクションは、パブリック・ライセンスの慣行によって実装されているフリーソフトウェアの配布システムの完全性を保護することのみを目的としています。

source: It is possible to remove code sections from the compiled script by wrapping them in directives:
ja: ディレクティブで囲むことによって、コンパイルされたスクリプトからコードセクションを削除することができる：

source: It is possible to show a window with only a title by leaving Text blank.
ja: Textを空白にすることで、タイトルだけのウィンドウを表示することができる。

source: It is possible to use norm to turn off all attributes and then selectively turn on others.
ja: ノームを使ってすべての属性をオフにし、他の属性を選択的にオンにすることが可能です。

source: It is retrieved from one of the following locations (in order):
ja: これは、以下のいずれかの場所から取得される（順番に）：

source: It is retrieved from one of the following locations (in order): 1) the environment variables TMP, TEMP, or USERPROFILE; 2) the Windows directory.
ja: これは、以下のいずれかの場所から取得される（順番に）：1) 環境変数TMP、TEMP、またはUSERPROFILE、2) Windowsディレクトリ。

source: It is running on a different version of AutoHotkey.
ja: AutoHotkeyの異なるバージョンで動作しています。

source: It is shown in the GUI, in addition to the file's name.
ja: GUIでは、ファイル名の他にこの文字も表示される。

source: It is still necessary to meet certain conditions before any such attempt can be made.
ja: このような試みを行うには、やはり一定の条件を満たす必要がある。

source: It is the preferred way to add new elements to an array, since the bracket notation can't be used to assign outside the current range of values.
ja: ブラケット記法は、現在の値の範囲外を代入するために使用することができないので、配列に新しい要素を追加するための好ましい方法です。

source: It is therefore best for __Delete to be entirely self-contained, and not rely on any global or static variables.
ja: したがって、__Deleteは完全に自己完結型とし、グローバル変数や静的変数に依存しないのがベストである。

source: It is typically used to avoid accidentally matching a word that appears inside some other word.
ja: これは通常、他の単語の中に現れる単語と誤ってマッチングするのを避けるために使われる。

source: It is unclear how this situation arises or whether it is normal, but experimenting with the controller number in the controller test script can help determine if this applies to your system.
ja: このような状況がどのように発生するのか、または正常かどうかは不明ですが、コントローラのテストスクリプトでコントローラ番号を実験することで、システムに該当するかどうかを判断することができます。

source: It is unclear how this situation arises or whether it is normal, but experimenting with the joystick number in the joystick test script can help determine if this applies to your system.
ja: この状況がどのように発生するのか、また正常なのかどうかは不明ですが、ジョイスティックテストスクリプトでジョイスティック番号を実験することで、ご自分のシステムに当てはまるかどうかを判断できます。

source: It is useful in cases where dispatching messages could interfere with the code currently executing, such as while handling certain types of messages during an OnMessage callback.
ja: OnMessageコールバックで特定のタイプのメッセージを処理するときなど、メッセージのディスパッチが現在実行中のコードに干渉する可能性がある場合に便利です。

source: It is usually best to apply this setting only after the rows have been added because that allows any newly-arrived vertical scroll bar to be taken into account when sizing the last column.
ja: この設定は、行が追加された後に適用するのが一般的です。そうすることで、新たに到着した垂直スクロールバーを考慮して、最後の列のサイズを設定することができるからです。

source: It is usually recommended to use the corresponding method instead.
ja: 通常、対応する方法を代わりに使用することが推奨されます。

source: It is usually unnecessary to call this function because the script is automatically persistent in most of the common cases where the user would want it to keep running, such as to respond to hotkeys, execute timers or display a GUI.
ja: ホットキーへの反応、タイマーの実行、GUIの表示など、ユーザーがスクリプトを実行し続けたいと思う一般的なケースのほとんどで、スクリプトは自動的に永続化されるため、通常この関数を呼び出す必要はありません。

source: It makes the script more reliable by ensuring that it operates on the same window each time, even when there are multiple matching windows, or if the window title changes after the window is "found".
ja: 一致するウィンドウが複数ある場合や、ウィンドウが「見つかった」後にウィンドウのタイトルが変更された場合でも、毎回同じウィンドウで動作するようにすることで、スクリプトの信頼性を高めています。

source: It may also be easier to identify the bounds of a function than a label subroutine.
ja: また、ラベルサブルーチンよりも関数の方が境界を特定しやすい場合もあります。

source: It may also be necessary to repair the default registry values, either by reinstalling AutoHotkey or by running UX\install.ahk from the AutoHotkey installation directory.
ja: また、AutoHotkeyを再インストールするか、AutoHotkeyのインストールディレクトリからUX\install.ahkを実行して、デフォルトレジストリ値を修復する必要がある場合もあります。

source: It may also improve reliability in other ways.
ja: また、それ以外の方法で信頼性を向上させることもあります。

source: It may be possible to detect the previous tray state by measuring the time the function takes to complete, as in the example below.
ja: 以下の例のように、機能が完了するまでの時間を測定することで、以前のトレイの状態を検出できる場合があります。

source: It may be superseded by module support in a future release.
ja: 将来のリリースでは、モジュールのサポートに取って代わられる可能性があります。

source: It may contain linefeeds (`n) to start new lines.
ja: 新しい行を開始するための改行(`n)を含むことができる。

source: It may include backreferences like $1, which brings in the substring from Haystack that matched the first subpattern.
ja: 最初のサブパターンにマッチしたHaystackの部分文字列を取り込む$1のような後方参照も含まれるかもしれません。

source: It might also reveal if your controller is in need of calibration; that is, whether the range of motion of each of its axes is from 0 to 100 percent as it should be.
ja: また、コントローラにキャリブレーションが必要かどうか、つまり、各軸の可動域が0から100パーセントまで、あるべき範囲にあるかどうかもわかるかもしれません。

source: It might move an existing untitled Notepad window instead of the new one.
ja: 新しいウィンドウではなく、既存の無題のメモ帳ウィンドウを移動することがあります。

source: It might not work if the indicated file's type does not have an "edit" action associated with it.
ja: 表示されたファイルの種類に「編集」アクションが関連付けられていない場合は、動作しないことがあります。

source: It might produce different behavior because it is similar in effect to pressing Alt+F4 or clicking the window's close button in its title bar:
ja: Alt+F4を押したり、タイトルバーにあるウィンドウの閉じるボタンをクリックしたりするのと同じような効果があるため、異なる動作をするかもしれません：

source: It must be preceded by a decimal point.
ja: その前に必ず小数点が付きます。

source: It must either be an ico file or the very first icon of an EXE or DLL.
ja: icoファイルか、EXEまたはDLLの一番最初のアイコンである必要があります。

source: It must end with a .ahk extension.
ja: 拡張子は.ahkで終わる必要があります。

source: It no longer does this.
ja: もはや、これ以上ないほどです。

source: It now requires a function object, not a name.
ja: 名前ではなく、関数オブジェクトを要求するようになりました。

source: It now supports function objects (and no longer supports function names).
ja: 関数オブジェクトをサポートするようになりました（関数名はサポートしなくなりました）。

source: It only worked this way for commands, not functions or variable declarations.
ja: このように動作するのはコマンドのみで、関数や変数宣言は対象外でした。

source: It performs the following functions:
ja: 以下のような機能を備えています：

source: It probably uses mouse pos & clicks.
ja: おそらくマウスのポーズとクリックを使っているのだろう。

source: It replaces "Control Choose", but also supports Tab controls.
ja: 「Control Choose」に代わるもので、Tabコントロールにも対応しています。

source: It requires the current character's status as a word character (\w) to be the opposite of the previous character's.
ja: 現在の文字の単語文字（\w）としての状態が、前の文字と逆であることを要求する。

source: It returns an Array.
ja: Arrayを返します。

source: It should also be noted that short-circuit evaluation cascades into nested ANDs and ORs.
ja: また、短絡的な評価は、ネストしたANDとORにカスケードすることに注意する必要があります。

source: It should only be used in an emergency because it may cause any open applications to lose data.
ja: 開いているアプリケーションがデータを失う可能性があるため、緊急時のみ使用してください。

source: It simply analyzes the provided string.
ja: これは単純に提供された文字列を解析するだけである。

source: It skips the rest of the loop's body.
ja: ループの残りの本体をスキップします。

source: It specifies a simple rectangle and left-aligns the text in the rectangle.
ja: これは単純な矩形を指定し、矩形内のテキストを左揃えにする。

source: It supports only the keyboard (AutoHotkey has mouse remapping and some limited controller remapping).
ja: キーボードのみをサポートしています（AutoHotkeyにはマウスリマッピングといくつかの限定的なコントローラリマッピングがあります）。

source: It supports up to five mouse buttons and the turning of the mouse wheel.
ja: 最大5つのマウスボタンとマウスホイールの回転をサポートする。

source: It then activates the next window in the series.
ja: そして、シリーズの次のウィンドウをアクティブにします。

source: It uses the SendInput method for Send, SendText, Click, and MouseMove/Click/Drag.
ja: SendInputメソッドを使用して、Send、SendText、Click、MouseMove/Click/Dragを行っています。

source: It was also used to retrieve the address of an object, and getting an address of the wrong type can have dire consequences.
ja: また、オブジェクトのアドレスを取得するために使用され、間違ったタイプのアドレスを取得すると、悲惨な結果になることがあります。

source: It was previously equivalent to x.y[z] := v.
ja: 以前はx.y[z] := vと同等でした。

source: It was previously only allowed by #IfWin and (Join.
ja: これまでは #IfWin と (Join でしか認められていませんでした。

source: It was superseded by InputHook.
ja: InputHookに取って代わられました。

source: It was synonymous with "Window", so use that instead.
ja: 「Window」と同義語だったので、代わりにそちらを使ってください。

source: It watches what you type and displays menus and parameter lists, which does some of the typing for you and reminds you of the order of parameters.
ja: 入力した内容を見ながらメニューやパラメータリストを表示し、入力の一部を代行したり、パラメータの順序を思い出させたりします。

source: It will also be blank if FilePattern contains a relative path and the body of the loop uses SetWorkingDir to switch away from the working directory in effect for the loop itself.
ja: また、FilePatternに相対パスが含まれていて、ループの本体がSetWorkingDirを使用してループ自体の有効な作業ディレクトリから切り離す場合は空白となります。

source: It will also register the v1 uninstaller, which is not capable of correctly uninstalling both versions.
ja: v1のアンインストーラーも登録されますが、これは両方のバージョンを正しくアンインストールすることができません。

source: It will be blank if none.
ja: ない場合は空白になる。

source: It will be blank whenever A_PriorHotkey is blank.
ja: A_PriorHotkeyが空白のときは常に空白になる。

source: It will be blank whenever A_ThisHotkey is blank.
ja: A_ThisHotkeyが空白のときは常に空白になります。

source: It will be empty if the currently retrieved item is of an unknown type.
ja: 現在検索されている項目が不明なタイプの場合、空となります。

source: It will be one of the following words:
ja: それは以下の言葉のいずれかとなる：

source: It will be one of the following words: AppStarting, Arrow, Cross, Help, IBeam, Icon, No, Size, SizeAll, SizeNESW, SizeNS, SizeNWSE, SizeWE, UpArrow, Wait, Unknown.
ja: それは以下の言葉のいずれかとなる：AppStarting、Arrow、Cross、Help、IBeam、Icon、No、Size、SizeAll、SizeNESW、SizeNS、SizeNWSE、SizeWE、UpArrow、Wait、Unknown。

source: It will change the registry for you.
ja: レジストリを変更してくれる。

source: It will take on a flat appearance rather than its normal button-like appearance.
ja: 通常のボタンのような外観ではなく、平らな外観になります。

source: It works like before, except that Submit() creates and returns a new object which contains all of the "associated variables".
ja: Submit()がすべての「関連変数」を含む新しいオブジェクトを作成し、返すことを除けば、以前と同じように動作します。

source: It would also prevent timers from running whenever another thread is sleeping or waiting.
ja: また、他のスレッドがスリープや待機しているときにタイマーが作動するのを防ぐことができます。

source: It's a good feeling, making something yourself without help.
ja: 人の手を借りずに自分で何かを作るというのはいい気分だ。

source: It's also possible with some rudimentary methods using Gui, but in a limited way.
ja: Guiを使った初歩的な方法でも可能ですが、限定的な方法です。

source: It's based on the v1 script created by Andreas Borutta.
ja: Andreas Boruttaが作成したv1スクリプトをベースにしています。

source: It's best you learn to indent ASAP.
ja: 早急にインデントを学んだ方がいい。

source: It's better to use this function than a loop of your own that checks to see if this clipboard is blank.
ja: このクリップボードが空白かどうかをチェックする独自のループよりも、この関数を使用する方がよいでしょう。

source: It's easy to configure.
ja: 設定は簡単である。

source: It's exactly the same as above, but I outdented the second line so we know it's separated from the if-statement:
ja: 上とまったく同じだが、2行目をアウトデントにして、if文と分離していることがわかるようにした：

source: It's how AHK knows that {!} means "exclamation point" and not "press Alt".
ja: {!}が「感嘆符」を意味し、「Altを押してください」を意味しないことをAHKが知っているのはそのためだ。

source: It's just that this particular way can be detrimental, thus it is OFF by default.
ja: ただ、この特殊な方法は有害であるため、デフォルトでオフになっています。

source: It's simply spacing to break up your code so you can see what belongs to what.
ja: これは単に、コードを分割するための間隔であり、何が何に属しているかがわかるようにするためのものである。

source: It's the wParam value.
ja: wParamの値です。

source: It's useful whenever the clipboard contains files, such as those copied from an open Explorer window (the program automatically converts such files to their file names).
ja: クリップボードにファイルが含まれている場合、例えば開いているエクスプローラーウィンドウからコピーされたファイル（プログラムは自動的にファイル名に変換します）などは、この機能を使うと便利です。

source: It's usually better to define a hotkey, run the example to load it up, and press the hotkey when you want to test its effect.
ja: 通常は、ホットキーを定義し、サンプルを実行してロードし、その効果を試したいときにホットキーを押すのがよいでしょう。

source: It's usually not the same as F1.
ja: 通常F1とは異なります。

source: Item text is displayed on a single line in icon view.
ja: アイコン表示では、項目テキストは1行で表示されます。

source: ItemState := SendMessage(0x102C, RowNumber - 1, 0xF000, LV) ; 0x102C is LVM_GETITEMSTATE. 0xF000 is LVIS_STATEIMAGEMASK.
ja: ItemState := SendMessage(0x102C, RowNumber - 1, 0xF000, LV) ; 0x102C は LVM_GETITEMSTATE です。0xF000はLVIS_STATEIMAGEMASKです。

source: Items are accessed using [] as shown in the previous sections.
ja: 項目へのアクセスは、前のセクションで示したように[]を使用する。

source: Items are aligned with the top of the list-view control in icon and small icon view.
ja: アイコン・ビューとスモール・アイコン・ビューでは、アイテムはリスト・ビュー・コントロールの上部に整列される。

source: Items are left-aligned in icon and small icon view.
ja: アイテムはアイコンとスモールアイコン表示で左寄せになります。

source: Items at the top level have no parent and thus return 0.
ja: トップレベルのアイテムは親を持たないため、0を返す。

source: Items can also be appended by omitting ItemToInsertBefore.
ja: また、ItemToInsertBeforeを省略することで、アイテムを追加することができる。

source: Items enclosed in parentheses are most commonly used to:
ja: 括弧で囲まれた項目は、最も一般的に使用される：

source: Items under the View menu control what the main window displays:
ja: 表示メニューの項目は、メインウィンドウの表示を制御します：

source: Items under the pointer are automatically highlighted.
ja: ポインターの下にある項目は自動的にハイライトされます。

source: Its effect is global:
ja: その効果は世界的だ：

source: Its effect is global: it cannot create remappings specific to a particular user, application, or locale.
ja: その効果は世界的だ：特定のユーザー、アプリケーション、ロケールに特化したリマッピングを作成することはできません。

source: Its exact type depends on the type of control and notification code.
ja: その正確な種類は、制御の種類と通知コードに依存します。

source: Its features include:
ja: その特徴は以下の通り：

source: Its main window is no longer top-level, such as if the script has used SetParent to change its parent to something other than NULL (0).
ja: スクリプトがSetParentを使って親をNULL（0）以外に変更した場合など、そのメインウィンドウがトップレベルでなくなる。

source: Its parameter is no longer optional, but can still be explicitly blank.
ja: そのパラメータはもはやオプションではありませんが、まだ明示的に空白にすることができます。

source: Its parameter may now optionally be enclosed in quote marks.
ja: そのパラメータは、オプションで引用符で囲むことができるようになりました。

source: Its second parameter is the value being assigned.
ja: その第2パラメータは、割り当てられる値である。

source: Its value is nonzero if the current session is remotely controlled; zero otherwise.
ja: この値は、現在のセッションが遠隔操作されている場合は0以外、そうでない場合は0となる。

source: Its virtual key code can be determined by following the steps at the bottom fo the key list page.
ja: その仮想キーコードは、キーリストのページ下部の手順で決定することができます。

source: Its virtual key code can be determined by following the steps at the bottom of the key list page.
ja: その仮想キーコードは、キー一覧ページの下部にある手順で決定することができます。

source: Japanese
ja: 日本語

source: Javanese
ja: ジャワ語

source: Joystick
ja: ジョイスティック

source: Joystick attributes other than buttons are not supported.
ja: ボタン以外のジョイスティック属性はサポートされていません。

source: Joystick hotkeys do not currently support modifier prefixes such as ^ (Ctrl) and # (Win).
ja: ジョイスティックホットキーは、現在、^（Ctrl）や#（Win）などの修飾語の接頭辞をサポートしていません。

source: Joystick hotkeys:
ja: ジョイスティックのホットキー：

source: Jumps to the end of the text then send four shift+left-arrow keystrokes.
ja: テキストの末尾にジャンプし、Shift+左矢印キーを4回送信します。

source: Jumps to the label named "MyLabel" and continues execution.
ja: 「MyLabel」という名前のラベルにジャンプし、実行を継続します。

source: Jumps to the specified label and continues execution.
ja: 指定されたラベルにジャンプし、実行を継続します。

source: Just kidding.
ja: 冗談だよ。

source: Just use the Text parameter, as before.
ja: 前回同様、Textパラメータを使用するだけです。

source: K = Kilobytes
ja: K = キロバイト

source: K, D, d, A, S, s, M, C, E and MonthCal's 1 and 2.
ja: K、D、d、A、S、s、M、C、E、および、MonthCalの1、2です。

source: KEY (i.e. the currently retrieved item is a subkey not a value), REG_SZ, REG_EXPAND_SZ, REG_MULTI_SZ, REG_DWORD, REG_QWORD, REG_BINARY, REG_LINK, REG_RESOURCE_LIST, REG_FULL_RESOURCE_DESCRIPTOR, REG_RESOURCE_REQUIREMENTS_LIST, REG_DWORD_BIG_ENDIAN (probably rare on most Windows hardware).
ja: KEY（つまり、現在検索されている項目は値ではなくサブキー）、REG_SZ、REG_EXPAND_SZ、REG_MULTI_SZ、REG_DWORD、REG_QWORD、REG_BINARY、REG_LINK、REG_RESOURCE_LIST、REG_FULL_RESOURCE_DESCRIPTOR、 REG_RESOURCE_REQUIREMENTS_LIST、 REG_DWORD_BIG_ENDIAN （ほとんどのWindowsハードでは稀でしょうね。）

source: Keep in mind that if something goes wrong, you can always exit the script.
ja: 何か問題が発生した場合は、いつでもスクリプトを終了できることを念頭に置いておいてください。

source: Keep trying and failing until your code fails no more.
ja: あなたのコードが失敗しなくなるまで、試行錯誤を続けてください。

source: KeepWinZRunning := false ; Reset in preparation for the next press of this hotkey.
ja: KeepWinZRunning := false ; 次にこのホットキーを押すときに備えて、リセットを行います。

source: KeepWinZRunning := false ; Signal that thread's loop to stop.
ja: KeepWinZRunning := false ; そのスレッドのループを停止させる信号を送る。

source: Keeping a key AlwaysOn or AlwaysOff requires the keyboard hook, which will be automatically installed in such cases.
ja: キーをAlwaysOnまたはAlwaysOffに保つには、キーボードフックが必要ですが、このような場合は自動的にインストールされます。

source: Key codes are not required to match an existing key.
ja: キーコードは、既存のキーと合わせる必要はありません。

source: Key history and script info - See KeyHistory.
ja: キーの履歴とスクリプト情報 -KeyHistoryを参照。

source: Key lookups are case insensitive according to the rules of the current user's locale.
ja: キー検索は、現在のユーザーのロケールの規則に従って、大文字と小文字を区別しません。

source: Key lookups are case sensitive.
ja: キーのルックアップは大文字と小文字を区別します。

source: Key lookups are case-sensitive.
ja: キーのルックアップは大文字と小文字を区別します。

source: Key name
ja: キー名

source: Key names
ja: キー名

source: Key names are never enclosed in braces within hotkeys, but must always be enclosed in braces for Send (if longer than one character).
ja: キー名は、ホットキー内では中括弧で囲むことはありませんが、Sendでは必ず中括弧で囲む必要があります（1文字より長い場合）。

source: Key-delay is ignored because a delay is not possible in this mode.
ja: このモードではディレイができないため、Key-delayは無視されます。

source: Key-delay:
ja: キーディレイです。

source: Key-down notifications must first be enabled by KeyOpt or NotifyNonText.
ja: キーダウンの通知は、まずKeyOptまたはNotifyNonTextで有効化する必要があります。

source: Key-repeat when the limit is too low relative to the key-repeat rate, or the system is under heavy load.
ja: キーリピート率に対してリミットが低すぎる場合、またはシステムが高負荷の場合にキーリピートします。

source: Key-up notifications must first be enabled by KeyOpt or NotifyNonText.
ja: キーアップ通知は、まずKeyOptまたはNotifyNonTextで有効化する必要があります。

source: KeyHistory - Syntax & Usage | AutoHotkey v2
ja: KeyHistory - 構文と使用法｜AutoHotkey v2

source: KeyOpt may then be called a second time to remove options from specific keys.
ja: その後、KeyOptを2回目に呼び出すと、特定のキーからオプションを削除することができます。

source: KeyWait "CapsLock" ; Wait for user to physically release it.
ja: KeyWait "CapsLock" ; ユーザーが物理的に解除するのを待ちます。

source: KeyWait "Control" ; Wait for both Control and Alt to be released.
ja: KeyWait "Control" ; ControlとAltの両方が解除されるのを待つ。

source: KeyWait "Control" ; Wait for the key to be released. Use one KeyWait for each of the hotkey's modifiers.
ja: KeyWait "Control" ; キーが解除されるのを待ちます。 ホットキーのモディファイアごとに1つのKeyWaitを使用します。

source: KeyWait "F1" ; This prevents keyboard auto-repeat from doing the DllCall repeatedly.
ja: KeyWait "F1" ; キーボードのオートリピートがDllCallを繰り返し実行するのを防ぐことができます。

source: KeyWait "NumpadAdd" ; Wait for the key to be released.
ja: KeyWait "NumpadAdd" ; キーが解除されるのを待ちます。

source: KeyWait - Syntax & Usage | AutoHotkey v2
ja: KeyWait - 構文と使用法｜AutoHotkey v2

source: KeyWait is used to stop the keyboard's auto-repeat feature from creating an unwanted double-press when you hold down the RControl key to modify another key.
ja: KeyWaitは、RControlキーを押しながら他のキーを変更する際に、キーボードのオートリピート機能が不要な二度押しを発生させないようにするために使用します。

source: Keyboard
ja: キーボード
